public class FieldNamesToBase
{
    void Formula()
    {
        //level0                - уровень
        //colAnswer: 4          - количество ответов (не более 11)
        //correctAnswer: 5      - очки за правильный ответ
        //numberValue: 10       - числа используемые в операциях (0-10, 0-100, 0-1000)
        //sign: 2               - кроичесвто арифметических операций (1 - (+), 2(+, -), 3(+, -, *), 4(+, -, *, /))
        //numberTerms: 2        - количество операндов (не более 3)
        //time: 60              - время раунда на уровне
        //wrongAnswer: 7        - штраф очков за неправильный ответ
        //easyPoints: 20        - легкое прохождение
        //normalPoints: 35      - среднее прохождение
        //hardPoints: 50        - сложное прохождение
    }
    void Labyrinth()
    {
        //level0                - уровень
        //colAnswer: 4          - количество ответов (не более 11)
        //correctAnswer: 5      - очки за правильный ответ
        //heightMesh: 4         - высота таблицы (не более 6) 
        //numberSprite: 4       - Вариативность условий поворота (не более 28) (1-4 - "Одинарные перемещения", 5-12 - "С двумя поворотами", 13-28 - "Три поворота")
        //time: 60              - время раунда на уровне
        //widthMesh: 4          - ширина таблицы (не более 10) 
        //wrongAnswer: 7        - штраф очков за неправильный ответ
        //easyPoints: 20        - легкое прохождение
        //normalPoints: 35      - среднее прохождение
        //hardPoints: 50        - сложное прохождение
    }
    void Merge()
    {
        //level0                - уровень
        //colAnswer: 4          - количество ответов (не более 8)
        //correctAnswer: 5      - очки за правильный ответ
        //numberTerms: 2        - количество операндов (не более 3)
        //sizeMesh: 3           - размер матриц используемых в операциях (не более 6)
        //time: 60              - время раунда на уровне
        //wrongAnswer: 7        - штраф очков за неправильный ответ
        //easyPoints: 20        - легкое прохождение
        //normalPoints: 35      - среднее прохождение
        //hardPoints: 50        - сложное прохождение
    }
    void UniqueDrawing()
    {
        //level0                - уровень
        //correctAnswer: 5      - очки за правильный ответ
        //diversitySprite: 5    - коэффициент разнообразия спрайтов (не более 9) (может сочитаться с 3 параметрами в самой игре: "Вид фигуры, форма фигур, цвет фигур") ///!!!Согласовать использование этого парамента на уровнях!!!
        //heightMesh: 4         - высота таблицы со спрайтами (не более 4)
        //time: 60              - время раунда на уровне
        //widthMesh: 4          - ширина таблицы со спрайтами (не более 8)
        //wrongAnswer: 7        - штраф очков за неправильный ответ
        //easyPoints: 20        - легкое прохождение
        //normalPoints: 35      - среднее прохождение
        //hardPoints: 50        - сложное прохождение
    }
}
